test/integration/load-100-noimg.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: test/integration/load.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 3m30s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 3m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 004/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 004/100 VUs  0m01.0s/3m00.0s

running (0m02.0s), 007/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 007/100 VUs  0m02.0s/3m00.0s

running (0m03.0s), 010/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 010/100 VUs  0m03.0s/3m00.0s

running (0m04.0s), 014/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 014/100 VUs  0m04.0s/3m00.0s

running (0m05.0s), 017/100 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 017/100 VUs  0m05.0s/3m00.0s

running (0m06.0s), 020/100 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 020/100 VUs  0m06.0s/3m00.0s

running (0m07.0s), 024/100 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 024/100 VUs  0m07.0s/3m00.0s

running (0m08.0s), 027/100 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 027/100 VUs  0m08.0s/3m00.0s

running (0m09.0s), 030/100 VUs, 1 complete and 0 interrupted iterations
default   [   5% ] 030/100 VUs  0m09.0s/3m00.0s

running (0m10.0s), 033/100 VUs, 2 complete and 0 interrupted iterations
default   [   6% ] 033/100 VUs  0m10.0s/3m00.0s

running (0m11.0s), 037/100 VUs, 3 complete and 0 interrupted iterations
default   [   6% ] 037/100 VUs  0m11.0s/3m00.0s

running (0m12.0s), 040/100 VUs, 5 complete and 0 interrupted iterations
default   [   7% ] 040/100 VUs  0m12.0s/3m00.0s

running (0m13.0s), 043/100 VUs, 6 complete and 0 interrupted iterations
default   [   7% ] 043/100 VUs  0m13.0s/3m00.0s

running (0m14.0s), 047/100 VUs, 13 complete and 0 interrupted iterations
default   [   8% ] 047/100 VUs  0m14.0s/3m00.0s

running (0m15.0s), 050/100 VUs, 17 complete and 0 interrupted iterations
default   [   8% ] 050/100 VUs  0m15.0s/3m00.0s

running (0m16.0s), 053/100 VUs, 20 complete and 0 interrupted iterations
default   [   9% ] 053/100 VUs  0m16.0s/3m00.0s

running (0m17.0s), 057/100 VUs, 22 complete and 0 interrupted iterations
default   [   9% ] 057/100 VUs  0m17.0s/3m00.0s

running (0m18.0s), 060/100 VUs, 25 complete and 0 interrupted iterations
default   [  10% ] 060/100 VUs  0m18.0s/3m00.0s

running (0m19.0s), 063/100 VUs, 29 complete and 0 interrupted iterations
default   [  11% ] 063/100 VUs  0m19.0s/3m00.0s

running (0m20.0s), 066/100 VUs, 35 complete and 0 interrupted iterations
default   [  11% ] 066/100 VUs  0m20.0s/3m00.0s

running (0m21.0s), 070/100 VUs, 38 complete and 0 interrupted iterations
default   [  12% ] 070/100 VUs  0m21.0s/3m00.0s

running (0m22.0s), 073/100 VUs, 44 complete and 0 interrupted iterations
default   [  12% ] 073/100 VUs  0m22.0s/3m00.0s

running (0m23.0s), 076/100 VUs, 50 complete and 0 interrupted iterations
default   [  13% ] 076/100 VUs  0m23.0s/3m00.0s

running (0m24.0s), 080/100 VUs, 58 complete and 0 interrupted iterations
default   [  13% ] 080/100 VUs  0m24.0s/3m00.0s

running (0m25.0s), 083/100 VUs, 65 complete and 0 interrupted iterations
default   [  14% ] 083/100 VUs  0m25.0s/3m00.0s

running (0m26.0s), 086/100 VUs, 72 complete and 0 interrupted iterations
default   [  14% ] 086/100 VUs  0m26.0s/3m00.0s

running (0m27.0s), 090/100 VUs, 77 complete and 0 interrupted iterations
default   [  15% ] 090/100 VUs  0m27.0s/3m00.0s

running (0m28.0s), 093/100 VUs, 83 complete and 0 interrupted iterations
default   [  16% ] 093/100 VUs  0m28.0s/3m00.0s

running (0m29.0s), 096/100 VUs, 90 complete and 0 interrupted iterations
default   [  16% ] 096/100 VUs  0m29.0s/3m00.0s

running (0m30.0s), 099/100 VUs, 95 complete and 0 interrupted iterations
default   [  17% ] 099/100 VUs  0m30.0s/3m00.0s

running (0m31.0s), 100/100 VUs, 102 complete and 0 interrupted iterations
default   [  17% ] 100/100 VUs  0m31.0s/3m00.0s

running (0m32.0s), 100/100 VUs, 114 complete and 0 interrupted iterations
default   [  18% ] 100/100 VUs  0m32.0s/3m00.0s

running (0m33.0s), 100/100 VUs, 115 complete and 0 interrupted iterations
default   [  18% ] 100/100 VUs  0m33.0s/3m00.0s

running (0m34.0s), 100/100 VUs, 120 complete and 0 interrupted iterations
default   [  19% ] 100/100 VUs  0m34.0s/3m00.0s

running (0m35.0s), 100/100 VUs, 126 complete and 0 interrupted iterations
default   [  19% ] 100/100 VUs  0m35.0s/3m00.0s

running (0m36.0s), 100/100 VUs, 136 complete and 0 interrupted iterations
default   [  20% ] 100/100 VUs  0m36.0s/3m00.0s

running (0m37.0s), 100/100 VUs, 148 complete and 0 interrupted iterations
default   [  21% ] 100/100 VUs  0m37.0s/3m00.0s

running (0m38.0s), 100/100 VUs, 159 complete and 0 interrupted iterations
default   [  21% ] 100/100 VUs  0m38.0s/3m00.0s

running (0m39.0s), 100/100 VUs, 170 complete and 0 interrupted iterations
default   [  22% ] 100/100 VUs  0m39.0s/3m00.0s

running (0m40.0s), 100/100 VUs, 179 complete and 0 interrupted iterations
default   [  22% ] 100/100 VUs  0m40.0s/3m00.0s

running (0m41.0s), 100/100 VUs, 183 complete and 0 interrupted iterations
default   [  23% ] 100/100 VUs  0m41.0s/3m00.0s

running (0m42.0s), 100/100 VUs, 190 complete and 0 interrupted iterations
default   [  23% ] 100/100 VUs  0m42.0s/3m00.0s

running (0m43.0s), 100/100 VUs, 204 complete and 0 interrupted iterations
default   [  24% ] 100/100 VUs  0m43.0s/3m00.0s

running (0m44.0s), 100/100 VUs, 214 complete and 0 interrupted iterations
default   [  24% ] 100/100 VUs  0m44.0s/3m00.0s

running (0m45.0s), 100/100 VUs, 219 complete and 0 interrupted iterations
default   [  25% ] 100/100 VUs  0m45.0s/3m00.0s

running (0m46.0s), 100/100 VUs, 232 complete and 0 interrupted iterations
default   [  26% ] 100/100 VUs  0m46.0s/3m00.0s

running (0m47.0s), 100/100 VUs, 250 complete and 0 interrupted iterations
default   [  26% ] 100/100 VUs  0m47.0s/3m00.0s

running (0m48.0s), 100/100 VUs, 260 complete and 0 interrupted iterations
default   [  27% ] 100/100 VUs  0m48.0s/3m00.0s

running (0m49.0s), 100/100 VUs, 264 complete and 0 interrupted iterations
default   [  27% ] 100/100 VUs  0m49.0s/3m00.0s

running (0m50.0s), 100/100 VUs, 274 complete and 0 interrupted iterations
default   [  28% ] 100/100 VUs  0m50.0s/3m00.0s

running (0m51.0s), 100/100 VUs, 282 complete and 0 interrupted iterations
default   [  28% ] 100/100 VUs  0m51.0s/3m00.0s

running (0m52.0s), 100/100 VUs, 295 complete and 0 interrupted iterations
default   [  29% ] 100/100 VUs  0m52.0s/3m00.0s

running (0m53.0s), 100/100 VUs, 307 complete and 0 interrupted iterations
default   [  29% ] 100/100 VUs  0m53.0s/3m00.0s

running (0m54.0s), 100/100 VUs, 310 complete and 0 interrupted iterations
default   [  30% ] 100/100 VUs  0m54.0s/3m00.0s

running (0m55.0s), 100/100 VUs, 318 complete and 0 interrupted iterations
default   [  31% ] 100/100 VUs  0m55.0s/3m00.0s

running (0m56.0s), 100/100 VUs, 330 complete and 0 interrupted iterations
default   [  31% ] 100/100 VUs  0m56.0s/3m00.0s

running (0m57.0s), 100/100 VUs, 339 complete and 0 interrupted iterations
default   [  32% ] 100/100 VUs  0m57.0s/3m00.0s

running (0m58.0s), 100/100 VUs, 354 complete and 0 interrupted iterations
default   [  32% ] 100/100 VUs  0m58.0s/3m00.0s

running (0m59.0s), 100/100 VUs, 364 complete and 0 interrupted iterations
default   [  33% ] 100/100 VUs  0m59.0s/3m00.0s

running (1m00.0s), 100/100 VUs, 370 complete and 0 interrupted iterations
default   [  33% ] 100/100 VUs  1m00.0s/3m00.0s

running (1m01.0s), 100/100 VUs, 379 complete and 0 interrupted iterations
default   [  34% ] 100/100 VUs  1m01.0s/3m00.0s

running (1m02.0s), 100/100 VUs, 389 complete and 0 interrupted iterations
default   [  34% ] 100/100 VUs  1m02.0s/3m00.0s

running (1m03.0s), 100/100 VUs, 397 complete and 0 interrupted iterations
default   [  35% ] 100/100 VUs  1m03.0s/3m00.0s

running (1m04.0s), 100/100 VUs, 410 complete and 0 interrupted iterations
default   [  36% ] 100/100 VUs  1m04.0s/3m00.0s

running (1m05.0s), 100/100 VUs, 421 complete and 0 interrupted iterations
default   [  36% ] 100/100 VUs  1m05.0s/3m00.0s

running (1m06.0s), 100/100 VUs, 428 complete and 0 interrupted iterations
default   [  37% ] 100/100 VUs  1m06.0s/3m00.0s

running (1m07.0s), 100/100 VUs, 439 complete and 0 interrupted iterations
default   [  37% ] 100/100 VUs  1m07.0s/3m00.0s

running (1m08.0s), 100/100 VUs, 452 complete and 0 interrupted iterations
default   [  38% ] 100/100 VUs  1m08.0s/3m00.0s

running (1m09.0s), 100/100 VUs, 459 complete and 0 interrupted iterations
default   [  38% ] 100/100 VUs  1m09.0s/3m00.0s

running (1m10.0s), 100/100 VUs, 468 complete and 0 interrupted iterations
default   [  39% ] 100/100 VUs  1m10.0s/3m00.0s

running (1m11.0s), 100/100 VUs, 477 complete and 0 interrupted iterations
default   [  39% ] 100/100 VUs  1m11.0s/3m00.0s

running (1m12.0s), 100/100 VUs, 485 complete and 0 interrupted iterations
default   [  40% ] 100/100 VUs  1m12.0s/3m00.0s

running (1m13.0s), 100/100 VUs, 492 complete and 0 interrupted iterations
default   [  41% ] 100/100 VUs  1m13.0s/3m00.0s

running (1m14.0s), 100/100 VUs, 504 complete and 0 interrupted iterations
default   [  41% ] 100/100 VUs  1m14.0s/3m00.0s

running (1m15.0s), 100/100 VUs, 516 complete and 0 interrupted iterations
default   [  42% ] 100/100 VUs  1m15.0s/3m00.0s

running (1m16.0s), 100/100 VUs, 526 complete and 0 interrupted iterations
default   [  42% ] 100/100 VUs  1m16.0s/3m00.0s

running (1m17.0s), 100/100 VUs, 536 complete and 0 interrupted iterations
default   [  43% ] 100/100 VUs  1m17.0s/3m00.0s

running (1m18.0s), 100/100 VUs, 547 complete and 0 interrupted iterations
default   [  43% ] 100/100 VUs  1m18.0s/3m00.0s

running (1m19.0s), 100/100 VUs, 557 complete and 0 interrupted iterations
default   [  44% ] 100/100 VUs  1m19.0s/3m00.0s

running (1m20.0s), 100/100 VUs, 567 complete and 0 interrupted iterations
default   [  44% ] 100/100 VUs  1m20.0s/3m00.0s

running (1m21.0s), 100/100 VUs, 573 complete and 0 interrupted iterations
default   [  45% ] 100/100 VUs  1m21.0s/3m00.0s

running (1m22.0s), 100/100 VUs, 580 complete and 0 interrupted iterations
default   [  46% ] 100/100 VUs  1m22.0s/3m00.0s

running (1m23.0s), 100/100 VUs, 589 complete and 0 interrupted iterations
default   [  46% ] 100/100 VUs  1m23.0s/3m00.0s

running (1m24.0s), 100/100 VUs, 603 complete and 0 interrupted iterations
default   [  47% ] 100/100 VUs  1m24.0s/3m00.0s

running (1m25.0s), 100/100 VUs, 614 complete and 0 interrupted iterations
default   [  47% ] 100/100 VUs  1m25.0s/3m00.0s

running (1m26.0s), 100/100 VUs, 622 complete and 0 interrupted iterations
default   [  48% ] 100/100 VUs  1m26.0s/3m00.0s

running (1m27.0s), 100/100 VUs, 630 complete and 0 interrupted iterations
default   [  48% ] 100/100 VUs  1m27.0s/3m00.0s

running (1m28.0s), 100/100 VUs, 640 complete and 0 interrupted iterations
default   [  49% ] 100/100 VUs  1m28.0s/3m00.0s

running (1m29.0s), 100/100 VUs, 650 complete and 0 interrupted iterations
default   [  49% ] 100/100 VUs  1m29.0s/3m00.0s

running (1m30.0s), 100/100 VUs, 660 complete and 0 interrupted iterations
default   [  50% ] 100/100 VUs  1m30.0s/3m00.0s

running (1m31.0s), 100/100 VUs, 670 complete and 0 interrupted iterations
default   [  51% ] 100/100 VUs  1m31.0s/3m00.0s

running (1m32.0s), 100/100 VUs, 675 complete and 0 interrupted iterations
default   [  51% ] 100/100 VUs  1m32.0s/3m00.0s

running (1m33.0s), 100/100 VUs, 690 complete and 0 interrupted iterations
default   [  52% ] 100/100 VUs  1m33.0s/3m00.0s

running (1m34.0s), 100/100 VUs, 699 complete and 0 interrupted iterations
default   [  52% ] 100/100 VUs  1m34.0s/3m00.0s

running (1m35.0s), 100/100 VUs, 709 complete and 0 interrupted iterations
default   [  53% ] 100/100 VUs  1m35.0s/3m00.0s

running (1m36.0s), 100/100 VUs, 718 complete and 0 interrupted iterations
default   [  53% ] 100/100 VUs  1m36.0s/3m00.0s

running (1m37.0s), 100/100 VUs, 728 complete and 0 interrupted iterations
default   [  54% ] 100/100 VUs  1m37.0s/3m00.0s

running (1m38.0s), 100/100 VUs, 736 complete and 0 interrupted iterations
default   [  54% ] 100/100 VUs  1m38.0s/3m00.0s

running (1m39.0s), 100/100 VUs, 746 complete and 0 interrupted iterations
default   [  55% ] 100/100 VUs  1m39.0s/3m00.0s

running (1m40.0s), 100/100 VUs, 752 complete and 0 interrupted iterations
default   [  56% ] 100/100 VUs  1m40.0s/3m00.0s

running (1m41.0s), 100/100 VUs, 762 complete and 0 interrupted iterations
default   [  56% ] 100/100 VUs  1m41.0s/3m00.0s

running (1m42.0s), 100/100 VUs, 775 complete and 0 interrupted iterations
default   [  57% ] 100/100 VUs  1m42.0s/3m00.0s

running (1m43.0s), 100/100 VUs, 783 complete and 0 interrupted iterations
default   [  57% ] 100/100 VUs  1m43.0s/3m00.0s

running (1m44.0s), 100/100 VUs, 792 complete and 0 interrupted iterations
default   [  58% ] 100/100 VUs  1m44.0s/3m00.0s

running (1m45.0s), 100/100 VUs, 805 complete and 0 interrupted iterations
default   [  58% ] 100/100 VUs  1m45.0s/3m00.0s

running (1m46.0s), 100/100 VUs, 816 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  1m46.0s/3m00.0s

running (1m47.0s), 100/100 VUs, 826 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  1m47.0s/3m00.0s

running (1m48.0s), 100/100 VUs, 835 complete and 0 interrupted iterations
default   [  60% ] 100/100 VUs  1m48.0s/3m00.0s

running (1m49.0s), 100/100 VUs, 840 complete and 0 interrupted iterations
default   [  61% ] 100/100 VUs  1m49.0s/3m00.0s

running (1m50.0s), 100/100 VUs, 850 complete and 0 interrupted iterations
default   [  61% ] 100/100 VUs  1m50.0s/3m00.0s

running (1m51.0s), 100/100 VUs, 862 complete and 0 interrupted iterations
default   [  62% ] 100/100 VUs  1m51.0s/3m00.0s

running (1m52.0s), 100/100 VUs, 865 complete and 0 interrupted iterations
default   [  62% ] 100/100 VUs  1m52.0s/3m00.0s

running (1m53.0s), 100/100 VUs, 878 complete and 0 interrupted iterations
default   [  63% ] 100/100 VUs  1m53.0s/3m00.0s

running (1m54.0s), 100/100 VUs, 891 complete and 0 interrupted iterations
default   [  63% ] 100/100 VUs  1m54.0s/3m00.0s

running (1m55.0s), 100/100 VUs, 904 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  1m55.0s/3m00.0s

running (1m56.0s), 100/100 VUs, 914 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  1m56.0s/3m00.0s

running (1m57.0s), 100/100 VUs, 921 complete and 0 interrupted iterations
default   [  65% ] 100/100 VUs  1m57.0s/3m00.0s

running (1m58.0s), 100/100 VUs, 933 complete and 0 interrupted iterations
default   [  66% ] 100/100 VUs  1m58.0s/3m00.0s

running (1m59.0s), 100/100 VUs, 940 complete and 0 interrupted iterations
default   [  66% ] 100/100 VUs  1m59.0s/3m00.0s

running (2m00.0s), 100/100 VUs, 951 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  2m00.0s/3m00.0s

running (2m01.0s), 100/100 VUs, 961 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  2m01.0s/3m00.0s

running (2m02.0s), 100/100 VUs, 969 complete and 0 interrupted iterations
default   [  68% ] 100/100 VUs  2m02.0s/3m00.0s

running (2m03.0s), 100/100 VUs, 976 complete and 0 interrupted iterations
default   [  68% ] 100/100 VUs  2m03.0s/3m00.0s

running (2m04.0s), 100/100 VUs, 990 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  2m04.0s/3m00.0s

running (2m05.0s), 100/100 VUs, 999 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  2m05.0s/3m00.0s

running (2m06.0s), 100/100 VUs, 1006 complete and 0 interrupted iterations
default   [  70% ] 100/100 VUs  2m06.0s/3m00.0s

running (2m07.0s), 100/100 VUs, 1016 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  2m07.0s/3m00.0s

running (2m08.0s), 100/100 VUs, 1026 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  2m08.0s/3m00.0s

running (2m09.0s), 100/100 VUs, 1040 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  2m09.0s/3m00.0s

running (2m10.0s), 100/100 VUs, 1045 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  2m10.0s/3m00.0s

running (2m11.0s), 100/100 VUs, 1053 complete and 0 interrupted iterations
default   [  73% ] 100/100 VUs  2m11.0s/3m00.0s

running (2m12.0s), 100/100 VUs, 1063 complete and 0 interrupted iterations
default   [  73% ] 100/100 VUs  2m12.0s/3m00.0s

running (2m13.0s), 100/100 VUs, 1074 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  2m13.0s/3m00.0s

running (2m14.0s), 100/100 VUs, 1086 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  2m14.0s/3m00.0s

running (2m15.0s), 100/100 VUs, 1095 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  2m15.0s/3m00.0s

running (2m16.0s), 100/100 VUs, 1107 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  2m16.0s/3m00.0s

running (2m17.0s), 100/100 VUs, 1118 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  2m17.0s/3m00.0s

running (2m18.0s), 100/100 VUs, 1125 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  2m18.0s/3m00.0s

running (2m19.0s), 100/100 VUs, 1133 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  2m19.0s/3m00.0s

running (2m20.0s), 100/100 VUs, 1141 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  2m20.0s/3m00.0s

running (2m21.0s), 100/100 VUs, 1149 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  2m21.0s/3m00.0s

running (2m22.0s), 100/100 VUs, 1160 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  2m22.0s/3m00.0s

running (2m23.0s), 100/100 VUs, 1172 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  2m23.0s/3m00.0s

running (2m24.0s), 100/100 VUs, 1182 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  2m24.0s/3m00.0s

running (2m25.0s), 100/100 VUs, 1191 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  2m25.0s/3m00.0s

running (2m26.0s), 100/100 VUs, 1200 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  2m26.0s/3m00.0s

running (2m27.0s), 100/100 VUs, 1212 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  2m27.0s/3m00.0s

running (2m28.0s), 100/100 VUs, 1226 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  2m28.0s/3m00.0s

running (2m29.0s), 100/100 VUs, 1231 complete and 0 interrupted iterations
default   [  83% ] 100/100 VUs  2m29.0s/3m00.0s

running (2m30.0s), 100/100 VUs, 1237 complete and 0 interrupted iterations
default   [  83% ] 100/100 VUs  2m30.0s/3m00.0s

running (2m31.0s), 100/100 VUs, 1248 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  2m31.0s/3m00.0s

running (2m32.0s), 100/100 VUs, 1257 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  2m32.0s/3m00.0s

running (2m33.0s), 099/100 VUs, 1268 complete and 0 interrupted iterations
default   [  85% ] 099/100 VUs  2m33.0s/3m00.0s

running (2m34.0s), 099/100 VUs, 1280 complete and 0 interrupted iterations
default   [  86% ] 099/100 VUs  2m34.0s/3m00.0s

running (2m35.0s), 099/100 VUs, 1286 complete and 0 interrupted iterations
default   [  86% ] 099/100 VUs  2m35.0s/3m00.0s

running (2m36.0s), 097/100 VUs, 1297 complete and 0 interrupted iterations
default   [  87% ] 097/100 VUs  2m36.0s/3m00.0s

running (2m37.0s), 095/100 VUs, 1307 complete and 0 interrupted iterations
default   [  87% ] 095/100 VUs  2m37.0s/3m00.0s

running (2m38.0s), 089/100 VUs, 1322 complete and 0 interrupted iterations
default   [  88% ] 089/100 VUs  2m38.0s/3m00.0s

running (2m39.0s), 087/100 VUs, 1329 complete and 0 interrupted iterations
default   [  88% ] 087/100 VUs  2m39.0s/3m00.0s

running (2m40.0s), 086/100 VUs, 1335 complete and 0 interrupted iterations
default   [  89% ] 086/100 VUs  2m40.0s/3m00.0s

running (2m41.0s), 085/100 VUs, 1341 complete and 0 interrupted iterations
default   [  89% ] 085/100 VUs  2m41.0s/3m00.0s

running (2m42.0s), 082/100 VUs, 1350 complete and 0 interrupted iterations
default   [  90% ] 082/100 VUs  2m42.0s/3m00.0s

running (2m43.0s), 077/100 VUs, 1361 complete and 0 interrupted iterations
default   [  91% ] 077/100 VUs  2m43.0s/3m00.0s

running (2m44.0s), 068/100 VUs, 1375 complete and 0 interrupted iterations
default   [  91% ] 068/100 VUs  2m44.0s/3m00.0s

running (2m45.0s), 064/100 VUs, 1385 complete and 0 interrupted iterations
default   [  92% ] 064/100 VUs  2m45.0s/3m00.0s

running (2m46.0s), 063/100 VUs, 1388 complete and 0 interrupted iterations
default   [  92% ] 063/100 VUs  2m46.0s/3m00.0s

running (2m47.0s), 059/100 VUs, 1402 complete and 0 interrupted iterations
default   [  93% ] 059/100 VUs  2m47.0s/3m00.0s

running (2m48.0s), 058/100 VUs, 1404 complete and 0 interrupted iterations
default   [  93% ] 058/100 VUs  2m48.0s/3m00.0s

running (2m49.0s), 050/100 VUs, 1416 complete and 0 interrupted iterations
default   [  94% ] 050/100 VUs  2m49.0s/3m00.0s

running (2m50.0s), 049/100 VUs, 1420 complete and 0 interrupted iterations
default   [  94% ] 049/100 VUs  2m50.0s/3m00.0s

running (2m51.0s), 047/100 VUs, 1423 complete and 0 interrupted iterations
default   [  95% ] 047/100 VUs  2m51.0s/3m00.0s

running (2m52.0s), 045/100 VUs, 1433 complete and 0 interrupted iterations
default   [  96% ] 045/100 VUs  2m52.0s/3m00.0s

running (2m53.0s), 041/100 VUs, 1439 complete and 0 interrupted iterations
default   [  96% ] 041/100 VUs  2m53.0s/3m00.0s

running (2m54.0s), 039/100 VUs, 1443 complete and 0 interrupted iterations
default   [  97% ] 039/100 VUs  2m54.0s/3m00.0s

running (2m55.0s), 035/100 VUs, 1447 complete and 0 interrupted iterations
default   [  97% ] 035/100 VUs  2m55.0s/3m00.0s

running (2m56.0s), 034/100 VUs, 1449 complete and 0 interrupted iterations
default   [  98% ] 034/100 VUs  2m56.0s/3m00.0s

running (2m57.0s), 032/100 VUs, 1452 complete and 0 interrupted iterations
default   [  98% ] 032/100 VUs  2m57.0s/3m00.0s

running (2m58.0s), 027/100 VUs, 1459 complete and 0 interrupted iterations
default   [  99% ] 027/100 VUs  2m58.0s/3m00.0s

running (2m59.0s), 021/100 VUs, 1465 complete and 0 interrupted iterations
default   [  99% ] 021/100 VUs  2m59.0s/3m00.0s

running (3m00.0s), 018/100 VUs, 1468 complete and 0 interrupted iterations
default   [ 100% ] 018/100 VUs  3m00.0s/3m00.0s

running (3m01.0s), 016/100 VUs, 1470 complete and 0 interrupted iterations
default ↓ [ 100% ] 018/100 VUs  3m0s

running (3m02.0s), 012/100 VUs, 1474 complete and 0 interrupted iterations
default ↓ [ 100% ] 018/100 VUs  3m0s

running (3m03.0s), 010/100 VUs, 1476 complete and 0 interrupted iterations
default ↓ [ 100% ] 018/100 VUs  3m0s

running (3m04.0s), 007/100 VUs, 1479 complete and 0 interrupted iterations
default ↓ [ 100% ] 018/100 VUs  3m0s

running (3m05.0s), 003/100 VUs, 1483 complete and 0 interrupted iterations
default ↓ [ 100% ] 018/100 VUs  3m0s

running (3m06.0s), 003/100 VUs, 1483 complete and 0 interrupted iterations
default ↓ [ 100% ] 018/100 VUs  3m0s

running (3m07.0s), 002/100 VUs, 1484 complete and 0 interrupted iterations
default ↓ [ 100% ] 018/100 VUs  3m0s

running (3m08.0s), 001/100 VUs, 1485 complete and 0 interrupted iterations
default ↓ [ 100% ] 018/100 VUs  3m0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    image_fail
    ✓ 'rate<0.01' rate=0.00%

    rate_limited_429
    ✓ 'count==0' count=0

    t_detail
    ✓ 'p(95)<1000' p(95)=193.82ms

    t_feed
    ✓ 'p(95)<1000' p(95)=338.7ms

    t_image
    ✓ 'p(95)<3000' p(95)=0s

    t_search
    ✓ 'p(95)<1000' p(95)=274.88ms


  █ TOTAL RESULTS 

    checks_total.......: 5944    31.462016/s
    checks_succeeded...: 100.00% 5944 out of 5944
    checks_failed......: 0.00%   0 out of 5944

    ✓ 피드 200
    ✓ 상세 200
    ✓ 검색 200
    ✓ 아티스트 200

    CUSTOM
    image_fail.....................: 0.00%  0 out of 0
    rate_limited_429...............: 0      0/s
    t_artists......................: avg=132.5ms  p(90)=261.94ms p(95)=326.31ms p(99)=1.22s    max=4.48s 
    t_detail.......................: avg=66.4ms   p(90)=135.12ms p(95)=193.82ms p(99)=567.72ms max=3.75s 
    t_feed.........................: avg=146.75ms p(90)=266.13ms p(95)=338.7ms  p(99)=1.3s     max=4.46s 
    t_image........................: avg=0s       p(90)=0s       p(95)=0s       p(99)=0s       max=0s    
    t_search.......................: avg=102.99ms p(90)=198.72ms p(95)=274.88ms p(99)=816.62ms max=4.08s 

    HTTP
    http_req_duration..............: avg=112.16ms p(90)=218.06ms p(95)=294.83ms p(99)=1.11s    max=4.48s 
      { expected_response:true }...: avg=112.16ms p(90)=218.06ms p(95)=294.83ms p(99)=1.11s    max=4.48s 
    http_req_failed................: 0.00%  0 out of 5944
    http_reqs......................: 5944   31.462016/s

    EXECUTION
    iteration_duration.............: avg=10.46s   p(90)=12.17s   p(95)=12.65s   p(99)=13.92s   max=16.52s
    iterations.....................: 1486   7.865504/s
    vus............................: 1      min=1         max=100
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 104 MB 550 kB/s
    data_sent......................: 2.2 MB 11 kB/s



running (3m08.9s), 000/100 VUs, 1486 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  3m0s